
welcome_text = """
Привет, {}! 👋
По всем вопросам к @eclitt
Нажми на кнопку "Отметиться 🧾" чтобы отметиться на паре!
Нажми на кнопку "Посмотреть журнал 📕" чтобы посмотреть кто на паре!
"""


help_text = """
Я умею:
🧾 - Отмечать на паре 
📕 - Открыть журнал
❓ - Помогать с командами
ℹ️ - Рассказывать о себе

Нажми на кнопку "Отметиться 🧾" чтобы отметиться на паре!
Нажми на кнопку "Посмотреть журнал 📕" чтобы посмотреть кто на паре!
"""

about_text = """
🤖 О боте:
Версия: 1.0
"""

response_text = """
Команда не распознанна!

Используйте кнопки ниже для взаимодействия с ботом или команды:
/start - перезапуск бота
или используйте кнопки ниже!
        """

location_text = """📍 *Для трансляции геолокации:*

1. Нажмите кнопку ниже
2. В открывшемся меню выберите 
   *«Transmit Live Location»*
3. Выберите время трансляции

Только так вы начнете настоящую трансляцию!"""

registration_notice = "\n\n❌ *Вы не зарегистрированы!*\nНажмите '👤 Зарегистрироваться' чтобы продолжить."